# St7DeleteCavityLoops

Delete all the cavity loops within the selected faces.

long St7DeleteCavityLoops(long uID)
Input Parameters
uID
Strand7 model file ID.
Dependencies
Selection
Faces can be selected using functions in Entity Selection.
Keep Selected
Assigned using St7SetKeepSelect.
Global Parameters
ivFacesChanged, ivLoopsDeleted.